; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 777950 2 3 3 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	thermograph2 - mode
	image0 - mode
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(have_image Planet4 image0)
	(have_image Planet5 image0)
	(have_image Star6 infrared1)
	(have_image Star7 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
3. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 0 of 4
4. (turn_to satellite1 planet5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet5)
   goals met: 0 of 4
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 4
6. (turn_to satellite1 planet4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet4)
   goals met: 0 of 4
7. (turn_to satellite0 star6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star6)
   goals met: 0 of 4
8. (turn_to satellite1 star7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star7)
   goals met: 0 of 4
9. (take_image satellite0 star6 instrument0 infrared1)
   added: (have_image star6 infrared1)
   goals met: 1 of 4
10. (turn_to satellite1 planet4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet4)
   goals met: 1 of 4
11. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   goals met: 1 of 4
12. (turn_to satellite1 star7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star7)
   goals met: 1 of 4
13. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 2 of 4
14. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 4
15. (turn_to satellite0 planet4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet4)
   goals met: 2 of 4
16. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 4
17. (take_image satellite0 planet4 instrument0 image0)
   added: (have_image planet4 image0)
   goals met: 3 of 4
18. (turn_to satellite1 star7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star7)
   goals met: 3 of 4
19. (take_image satellite1 star7 instrument3 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 4 of 4
